Revit 2024 API
BuiltInFailures.FamilyFailures.CantPlaceInsertsError Property
 Can't place inserts outside of hosts. These elements won't be copied.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CantPlaceInsertsError { get; }
Visual Basic
Public Shared ReadOnly Property CantPlaceInsertsError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CantPlaceInsertsError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace